nce3-2/L29.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-15 Fri 23:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org00e74e3" class="outline-2">
<h2 id="org00e74e3">Lesson 29 Funny or not?</h2>
<div class="outline-text-2" id="text-org00e74e3">
<p class="verse">
What is the basis of 'sick' humour?<br />
<br />
Whether we find a joke funny or not largely depends on where we have been brought up.<br />
The sense of humour <b>is mysteriously bound up with</b> national characteristics.<br />
A Frenchman, for instance, might <b>find it hard to laugh</b> at a Russian joke.<br />
In the same way, a Russian might fail to see anything amusing in a joke<br />
&#xa0;which would make an Englishman <b>laugh to tears</b>.<br />
<br />
Most funny stories are based on comic situations.<br />
In spite of national differences, certain funny situations <b>have a universal appeal</b>.<br />
No matter where you live, you would find it difficult not to laugh at,<br />
&#xa0;say, Charlie Chaplin's early films.<br />
However, a new type of humour, which <b>stems largely from</b> the US, has recently <b>come into fashion</b>.<br />
It is called 'sick humour'.<br />
Comedians <b>base their jokes on</b> tragic situations like violent death or serious accidents.<br />
Many people find this sort of joke distasteful.<br />
The following example of 'sick humour' will enable you to <b>judge for yourself</b>.<br />
<br />
A man who had broken his right leg was taken to hospital a few weeks before Christmas.<br />
From the moment he arrived there,<br />
&#xa0;he kept on <b>pestering his doctor to tell</b> him when he would be able to go home.<br />
He <b>dreaded having</b> to spend Christmas in hospital.<br />
Though the doctor <b>did his best</b>, the patient's recovery was slow.<br />
On Christmas Day, the man still had his right leg in plaster.<br />
He spent a miserable day in bed thinking of all the fun he was missing.<br />
The following day, however, the doctor consoled him by telling him<br />
&#xa0;that his chances of being able to leave hospital in time for New Year celebrations were good.<br />
The man <b>took heart</b> and, sure enough, on New Year's Eve he was able to hobble along to a party.<br />
To <b>compensate for</b> his unpleasant experiences in hospital,<br />
&#xa0;the man drank a little more than <b>was good for him</b>.<br />
<b>In the process</b>, he enjoyed himself thoroughly<br />
&#xa0;and kept telling everybody how much he hated hospitals.<br />
He was still mumbling something about hospitals at the end of the party<br />
&#xa0;when he slipped on a piece of ice and broke his left leg.<br />
</p>
</div>

<div id="outline-container-orgcf7c9aa" class="outline-3">
<h3 id="orgcf7c9aa">words</h3>
<div class="outline-text-3" id="text-orgcf7c9aa">
<p>
largely [ˈlɑːrdʒli] adv. 在很大程度上<br />
comic [ˈkɑːmɪk] adj. 喜剧的,可笑的<br />
universal [ˌjuːnɪˈvɜːrs(ə)l] adj. 普遍的<br />
comedian [kəˈmiːdiən] n. 滑稽演员,喜剧演员<br />
distasteful [dɪsˈteɪstf(ə)l] adj. 讨厌的<br />
pester [ˈpestər] v. 一再要求,纠缠<br />
dread [dred] v. 惧怕<br />
recovery [rɪˈkʌvəri] n. 康复<br />
plaster [ˈplæstər] n. 熟石膏<br />
console [kənˈsoʊl] v. 安慰,慰问<br />
hobble [ˈhɑːb(ə)l] v. 瘸着退走<br />
compensate [ˈkɑːmpenseɪt] v. 补偿<br />
mumble [ˈmʌmb(ə)l] v. 喃喃自语<br />
</p>
</div>
</div>

<div id="outline-container-org0cf7c81" class="outline-3">
<h3 id="org0cf7c81"><span class="done DONE">DONE</span> 单词造句</h3>
<div class="outline-text-3" id="text-org0cf7c81">
<p>
largely adv.<br />
</p>
<ol class="org-ol">
<li>It is him who are largely responsible for the team's success, not you.<br /></li>
<li>We are largely likely to make a profit this year.<br /></li>
<li>I largely work with people who work in office.<br /></li>
<li>I largely read science fiction to my daughter before she sleeps.<br /></li>
<li>This largely indicates that she has got back to the ship.<br /></li>
</ol>
<p>
comic adj.n.漫画  comic book/movie/novel<br />
</p>
<ol class="org-ol">
<li>I spoted him reading comic books in the class.<br /></li>
<li>She claimed to have not read comic books in the class.<br /></li>
<li>Our parents always put the comic books in the same class as harmful.<br /></li>
<li>It is outrageous that she is interested in comic novels.<br /></li>
<li>My friend thrust his comic book into my hands.<br /></li>
</ol>
<p>
universal adj.  have a universal appeal<br />
</p>
<ol class="org-ol">
<li>The songs which he made in his youth have a universal appeal all over the world.<br /></li>
<li>It is all very well that a delicacy has a universal appeal.<br /></li>
<li>She claimed that snails have a universal appeal as a dish.<br /></li>
<li>We devised a plan to make a movie that has a universal appeal.<br /></li>
<li>Countless people have been influenced by a song which has a universal appeal.<br /></li>
</ol>
<p>
comedian n.<br />
</p>
<ol class="org-ol">
<li>Damn it. I have recognized the comedian as a normal person in the market.<br /></li>
<li>The comedian which play the role of a teacher gave us a surprise.<br /></li>
<li>The comedian was cast in the role of a kidnappered.<br /></li>
<li>The comedian proceed to stay out of the limelight.<br /></li>
<li>The comedian insisted that the paper should be written out in full.<br /></li>
</ol>
<p>
distasteful adj.<br />
</p>
<ol class="org-ol">
<li>I insisted that the woman who made such distasteful remarks apologize to us.<br /></li>
<li>You have played a joke on your husband at the party. I found this distasteful.<br /></li>
<li>Don't bring your custom to my mouth. I found it distasteful.<br /></li>
<li>If you found it distasteful, you should tell me.<br /></li>
<li>It was not until an hour after the police arrived on the scene<br />
that he stop making distasteful remark.<br /></li>
</ol>
<p>
pester v.  pester sb. to do sth.<br />
</p>
<ol class="org-ol">
<li>My wife has been pestering me to travel abroad.<br /></li>
<li>Because I pestered him to go to university, we eventually reached an agreement.<br /></li>
<li>Don't pester me to buy this or that product, I am under a lot of pressure.<br /></li>
<li>I am relieved to hear that he stop pestering his father to check the garage.<br /></li>
<li>My cat have been pestering me to play ball with her.<br /></li>
</ol>
<p>
dread v.  dread doing sth.  dread sb. doing sth.<br />
</p>
<ol class="org-ol">
<li>In fact, I really dread traveling abroad.<br /></li>
<li>I am under a lot of pressure and dread my boss ordering me to finish it.<br /></li>
<li>Much as she loved to go on a jourey, she dreaded asking his father for money.<br /></li>
<li>The thief caught sight of policemen in front of his house and dreaded getting back home.<br /></li>
<li>She woke up with a start and dreaded peeing in the midnight.<br /></li>
</ol>
<p>
recovery n.  make a complete/quick/speedy/slow recovery<br />
</p>
<ol class="org-ol">
<li>After an operation, he soon made a complete recovery.<br /></li>
<li>The fact that my cat made a slow recovery afflicted me a great deal.<br /></li>
<li>If you had an operation, you would make a complete recovery.<br /></li>
<li>He made a complete recovery, for he refused to follow his doctor's instructions.<br /></li>
<li>I'm glad that you made a full recovery.<br /></li>
</ol>
<p>
plaster n.<br />
</p>
<ol class="org-ol">
<li>She wasn't able to play truent from school, for her leg was still in plaster.<br /></li>
<li>As my foot was in plaster at that time, I have a perfect alibi.<br /></li>
<li>Whether my leg is in plaster or not is something that has no influence on taking the test.<br /></li>
<li>Whether my leg is in plaster or not doesn't prevent me from watching TV.<br /></li>
<li>Whether my leg is in plaster or not doesn't prevent me from being your husband.<br /></li>
</ol>
<p>
console v.  console sb./yourself that + &#x2026;<br />
</p>
<ol class="org-ol">
<li>I consoled myself that Miumiu is very dear to me.<br /></li>
<li>I consoled myself that I would get a good salary in the future.<br /></li>
<li>She consoled me that our daughter has said magic word.<br /></li>
<li>I consoled my wife that the girl just classified us as beggars.<br /></li>
<li>I consoled my wife that our son would soon take heart.<br /></li>
</ol>
<p>
hobble v.<br />
</p>
<ol class="org-ol">
<li>I was strucked by a ball and had to hobble home.<br /></li>
<li>As the medicine exerts some influence on him, he had to hobble across the park.<br /></li>
<li>A old lady hobbled to the store to get samples of perfume for nothing.<br /></li>
<li>The cat who is hobbling arose the pity of mine.<br /></li>
<li>It is anticipated that he would hobble home afther he was hurt in the game.<br /></li>
</ol>
<p>
compensate v.  compensate (for sth.) = make up for<br />
</p>
<ol class="org-ol">
<li>In the university, my breakfast used to be compensated by lunch.<br /></li>
<li>The busmen were compensated for better salary and less work time.<br /></li>
<li>My wife was compensated for a nice dress which she expected to buy for a long time.<br /></li>
<li>The fans of the singer were made up for some tickets.<br /></li>
<li>You will be made up for studying abroad.<br /></li>
</ol>
<p>
mumble v.<br />
</p>
<ol class="org-ol">
<li>He seems to be mumbling his lover's name in sleep.<br /></li>
<li>A woman who was making a speech in the open was mumbling, you made a spectacle of herself.<br /></li>
<li>If you mumbled at that time, you might make a spectacle of yourself.<br /></li>
<li>She was mumbling her cat's name to herself.<br /></li>
<li>In going to office, I always mumble names of my wife and my cat.<br /></li>
</ol>
</div>
</div>

<div id="outline-container-org0053804" class="outline-3">
<h3 id="org0053804">反复听电影片段直到懂关键句</h3>
</div>
<div id="outline-container-org348d0f9" class="outline-3">
<h3 id="org348d0f9">复习二册语法(笔记或视频) &amp; 红皮书</h3>
</div>
<div id="outline-container-orgbfb1fda" class="outline-3">
<h3 id="orgbfb1fda">习惯用法造句</h3>
<div class="outline-text-3" id="text-orgbfb1fda">
<p>
be bound up with<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
find it hard to do sth.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
make sb. laugh to tears<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
stem from &#x2026;<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
come into fashion<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
base a. on b.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
judge for yourself<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
do one's best (to do sth.)<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
take heart<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
be good for sb.<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
<p>
in the process<br />
</p>
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>

<div id="outline-container-org9b47129" class="outline-3">
<h3 id="org9b47129">跟读 50遍</h3>
</div>
<div id="outline-container-org31507a3" class="outline-3">
<h3 id="org31507a3">Comprehension 反复练习</h3>
</div>
<div id="outline-container-org4556562" class="outline-3">
<h3 id="org4556562">Ask me if 写+读</h3>
</div>
<div id="outline-container-org8bc5014" class="outline-3">
<h3 id="org8bc5014">摘要写作 写 &amp; 对答案</h3>
</div>
<div id="outline-container-org1fa5503" class="outline-3">
<h3 id="org1fa5503">tell the story 口语复述</h3>
</div>
<div id="outline-container-orgd186e67" class="outline-3">
<h3 id="orgd186e67">composition 阅读 或 写作</h3>
</div>
<div id="outline-container-orgd198766" class="outline-3">
<h3 id="orgd198766">Topics for discussion</h3>
</div>
</div>
</div>
</body>
</html>
